In [1]:
import pymysql
import pandas as pd


host = "localhost"
port = 3306
user = "root"
passwd = "12345"
db = "helloworld"

db = pymysql.connect(host=host, port=port, user=user, passwd=passwd, db=db, charset="utf8")
cursor = db.cursor()

## SELECT list

There are functions that can be applied to the records in feature(s) to be called. Note that there are special patterns to find the values that matches them which are used with `LIKE`. Examples are:
<ul>
    <li>'A%'  : Matches record whose field value starts with A</li>
    <li>'%A%' : Matches record whose fdn value contains A</li>
    <li>'A__' : Matches record whose fdn value contains pattern A followed by two characters</li>
</ul>

In [2]:
sql = """
    SELECT sepal_length
    FROM iris
    WHERE species LIKE "s%" AND sepal_length > 5.5
"""
pd.read_sql(sql, db)

   sepal_length
0           5.8
1           5.7
2           5.7

In [3]:
sql = """
    SELECT COUNT(sepal_length) AS SL_Count
    FROM iris
    WHERE species LIKE "s%" AND sepal_length > 5.5
"""
pd.read_sql(sql, db)

   SL_Count
0         3

## GROUP BY

API to aggregate the record by specific column.

In [4]:
sql = """
    SELECT COUNT(petal_width) AS howmany, species
    FROM iris
    WHERE species LIKE "%color%" OR species LIKE "%virgin%"
    GROUP BY species
"""
pd.read_sql(sql, db)

   howmany     species
0       50  versicolor
1       50   virginica

## HAVING

When reporting the aggregated result using `GROUP BY`, user might want to read the result of specific group that matches certain condition(s). For example, average value of PETAL_LENGTH variable of each species can be calculated as below.

In [5]:
sql = """
    SELECT AVG(petal_length) AS PL_AVG, species
    FROM iris
    GROUP BY species
"""
pd.read_sql(sql, db)

   PL_AVG     species
0   1.462      setosa
1   4.260  versicolor
2   5.552   virginica

User might attempt to filter out setosa group, and this can be done by filtering the group by average PETAL_LENGTH value. API to select specific group that matches certain condition is `HAVING` and its usage that exclude setosa group can be written as below.

In [6]:
sql = """
    SELECT COUNT(species) AS HOWMANY, species
    FROM iris
    GROUP BY species
    HAVING AVG(petal_length) > 4
"""
pd.read_sql(sql, db)

   HOWMANY     species
0       50  versicolor
1       50   virginica

## ORDER BY

Literally, API to arrange records according to the values of specified field. `DESC` can be attached when making arrangement in descending order.

In [7]:
sql = """
    SELECT AVG(petal_length) AS PL_AVG, species
    FROM iris
    GROUP BY species
    HAVING PL_AVG > 4
    ORDER BY PL_AVG DESC
"""
pd.read_sql(sql, db)

   PL_AVG     species
0   5.552   virginica
1   4.260  versicolor

## LIMIT

These are records whose SEPAL_LENGTH value is larger than 7.5

In [8]:
sql = """
    SELECT *
    FROM iris
    WHERE sepal_length > 7.5
"""
pd.read_sql(sql, db)

   SEPAL_LENGTH  SEPAL_WIDTH  PETAL_LENGTH  PETAL_WIDTH    SPECIES
0           7.6          3.0           6.6          2.1  virginica
1           7.7          3.8           6.7          2.2  virginica
2           7.7          2.6           6.9          2.3  virginica
3           7.7          2.8           6.7          2.0  virginica
4           7.9          3.8           6.4          2.0  virginica
5           7.7          3.0           6.1          2.3  virginica

To avoid lengthiness, user might want to read only first 4 records from the quried data. To get such result, LIMIT clause should be used as below.

In [9]:
sql = """
    SELECT *
    FROM iris
    WHERE sepal_length > 7.5
    LIMIT 4
"""
pd.read_sql(sql, db)

   SEPAL_LENGTH  SEPAL_WIDTH  PETAL_LENGTH  PETAL_WIDTH    SPECIES
0           7.6          3.0           6.6          2.1  virginica
1           7.7          3.8           6.7          2.2  virginica
2           7.7          2.6           6.9          2.3  virginica
3           7.7          2.8           6.7          2.0  virginica

If, more specifically, user wants to read first 4 records from the data where first 2 records are excluded, LIMIT clause should be used as below.

In [10]:
sql = """
    SELECT *
    FROM iris
    WHERE sepal_length > 7.5
    LIMIT 2,4
"""
pd.read_sql(sql, db)

   SEPAL_LENGTH  SEPAL_WIDTH  PETAL_LENGTH  PETAL_WIDTH    SPECIES
0           7.7          2.6           6.9          2.3  virginica
1           7.7          2.8           6.7          2.0  virginica
2           7.9          3.8           6.4          2.0  virginica
3           7.7          3.0           6.1          2.3  virginica